/******************************************************************/
/* åç§°ï¼š24c01åŠŸèƒ½å‡½æ•°                                                    */
/* æ•ˆæœï¼š                                                        */
/* å†…å®¹ï¼š                                                       */
/* ä½œè€…ï¼šzhan                                                  */
/* è”ç³»æ–¹å¼QQ:363116119                                        */
/******************************************************************/
#include "IIC_24C01.h"
#include "AT24C01.h"
#include "my_register.h"
/*
*********************************************************************************************************
*	º¯ Êı Ãû: ee_CheckOk
*	¹¦ÄÜËµÃ÷: ÅĞ¶Ï´®ĞĞEERPOMÊÇ·ñÕı³£
*	ĞÎ    ²Î£ºÎŞ
*	·µ »Ø Öµ: 1 ±íÊ¾Õı³££¬ 0 ±íÊ¾²»Õı³£
*********************************************************************************************************
*/
vu8 ee_CheckOk(void)
{
	if (i2c_CheckDevice(EE_DEV_ADDR) == 0)
	{
		return 1;
	}
	else
	{
		/* Ê§°Üºó£¬ÇĞ¼Ç·¢ËÍI2C×ÜÏßÍ£Ö¹ĞÅºÅ */
		i2c_Stop();		
		return 0;
	}
}

/*
*********************************************************************************************************
*	º¯ Êı Ãû: ee_ReadBytes
*	¹¦ÄÜËµÃ÷: ´Ó´®ĞĞEEPROMÖ¸¶¨µØÖ·´¦¿ªÊ¼¶ÁÈ¡Èô¸ÉÊı¾İ
*	ĞÎ    ²Î£º_usAddress : ÆğÊ¼µØÖ·
*			 _usSize : Êı¾İ³¤¶È£¬µ¥Î»Îª×Ö½Ú
*			 _pReadBuf : ´æ·Å¶Áµ½µÄÊı¾İµÄ»º³åÇøÖ¸Õë
*	·µ »Ø Öµ: 0 ±íÊ¾Ê§°Ü£¬1±íÊ¾³É¹¦
*********************************************************************************************************
*/
vu8 ReadBytes(vu8 *_pReadBuf, vu16 _usAddress, vu16 _usSize)
{
	vu16 i;
	
	/* ²ÉÓÃ´®ĞĞEEPROMËæ¼´¶ÁÈ¡Ö¸ÁîĞòÁĞ£¬Á¬Ğø¶ÁÈ¡Èô¸É×Ö½Ú */
	
	/* µÚ1²½£º·¢ÆğI2C×ÜÏßÆô¶¯ĞÅºÅ */
	i2c_Start();
	
	/* µÚ2²½£º·¢Æğ¿ØÖÆ×Ö½Ú£¬¸ß7bitÊÇµØÖ·£¬bit0ÊÇ¶ÁĞ´¿ØÖÆÎ»£¬0±íÊ¾Ğ´£¬1±íÊ¾¶Á */
	i2c_SendByte(EE_DEV_ADDR | I2C_WR);	/* ´Ë´¦ÊÇĞ´Ö¸Áî */
	
	/* µÚ3²½£º·¢ËÍACK */
	if (i2c_WaitAck() != 0)
	{
		goto cmd_fail;	/* EEPROMÆ÷¼şÎŞÓ¦´ğ */
	}

	/* µÚ4²½£º·¢ËÍ×Ö½ÚµØÖ·£¬24C02Ö»ÓĞ256×Ö½Ú£¬Òò´Ë1¸ö×Ö½Ú¾Í¹»ÁË£¬Èç¹ûÊÇ24C04ÒÔÉÏ£¬ÄÇÃ´´Ë´¦ĞèÒªÁ¬·¢¶à¸öµØÖ· */
	i2c_SendByte((vu8)_usAddress);
	
	/* µÚ5²½£º·¢ËÍACK */
	if (i2c_WaitAck() != 0)
	{
		goto cmd_fail;	/* EEPROMÆ÷¼şÎŞÓ¦´ğ */
	}
	
	/* µÚ6²½£ºÖØĞÂÆô¶¯I2C×ÜÏß¡£Ç°ÃæµÄ´úÂëµÄÄ¿µÄÏòEEPROM´«ËÍµØÖ·£¬ÏÂÃæ¿ªÊ¼¶ÁÈ¡Êı¾İ */
	i2c_Start();
	
	/* µÚ7²½£º·¢Æğ¿ØÖÆ×Ö½Ú£¬¸ß7bitÊÇµØÖ·£¬bit0ÊÇ¶ÁĞ´¿ØÖÆÎ»£¬0±íÊ¾Ğ´£¬1±íÊ¾¶Á */
	i2c_SendByte(EE_DEV_ADDR | I2C_RD);	/* ´Ë´¦ÊÇ¶ÁÖ¸Áî */
	
	/* µÚ8²½£º·¢ËÍACK */
	if (i2c_WaitAck() != 0)
	{
		goto cmd_fail;	/* EEPROMÆ÷¼şÎŞÓ¦´ğ */
	}	
	
	/* µÚ9²½£ºÑ­»·¶ÁÈ¡Êı¾İ */
	for (i = 0; i < _usSize; i++)
	{
		_pReadBuf[i] = i2c_ReadByte();	/* ¶Á1¸ö×Ö½Ú */
		
		/* Ã¿¶ÁÍê1¸ö×Ö½Úºó£¬ĞèÒª·¢ËÍAck£¬ ×îºóÒ»¸ö×Ö½Ú²»ĞèÒªAck£¬·¢Nack */
		if (i != _usSize - 1)
		{
			i2c_Ack();	/* ÖĞ¼ä×Ö½Ú¶ÁÍêºó£¬CPU²úÉúACKĞÅºÅ(Çı¶¯SDA = 0) */
		}
		else
		{
			i2c_NAck();	/* ×îºó1¸ö×Ö½Ú¶ÁÍêºó£¬CPU²úÉúNACKĞÅºÅ(Çı¶¯SDA = 1) */
		}
	}
	/* ·¢ËÍI2C×ÜÏßÍ£Ö¹ĞÅºÅ */
	i2c_Stop();
	return 1;	/* Ö´ĞĞ³É¹¦ */

cmd_fail: /* ÃüÁîÖ´ĞĞÊ§°Üºó£¬ÇĞ¼Ç·¢ËÍÍ£Ö¹ĞÅºÅ£¬±ÜÃâÓ°ÏìI2C×ÜÏßÉÏÆäËûÉè±¸ */
	/* ·¢ËÍI2C×ÜÏßÍ£Ö¹ĞÅºÅ */
	i2c_Stop();
	return 0;
}

/*
*********************************************************************************************************
*	º¯ Êı Ãû: ee_WriteBytes
*	¹¦ÄÜËµÃ÷: Ïò´®ĞĞEEPROMÖ¸¶¨µØÖ·Ğ´ÈëÈô¸ÉÊı¾İ£¬²ÉÓÃÒ³Ğ´²Ù×÷Ìá¸ßĞ´ÈëĞ§ÂÊ
*	ĞÎ    ²Î£º_usAddress : ÆğÊ¼µØÖ·
*			 _usSize : Êı¾İ³¤¶È£¬µ¥Î»Îª×Ö½Ú
*			 _pWriteBuf : ´æ·Å¶Áµ½µÄÊı¾İµÄ»º³åÇøÖ¸Õë
*	·µ »Ø Öµ: 0 ±íÊ¾Ê§°Ü£¬1±íÊ¾³É¹¦
*********************************************************************************************************
*/
vu8 WriteBytes(vu8 *_pWriteBuf, vu16 _usAddress, vu16 _usSize)
{
	vu16 i,m;
	vu16 usAddr;
	
	/* 
		Ğ´´®ĞĞEEPROM²»Ïñ¶Á²Ù×÷¿ÉÒÔÁ¬Ğø¶ÁÈ¡ºÜ¶à×Ö½Ú£¬Ã¿´ÎĞ´²Ù×÷Ö»ÄÜÔÚÍ¬Ò»¸öpage¡£
		¶ÔÓÚ24xx02£¬page size = 8
		¼òµ¥µÄ´¦Àí·½·¨Îª£º°´×Ö½ÚĞ´²Ù×÷Ä£Ê½£¬Ã»Ğ´1¸ö×Ö½Ú£¬¶¼·¢ËÍµØÖ·
		ÎªÁËÌá¸ßÁ¬ĞøĞ´µÄĞ§ÂÊ: ±¾º¯Êı²ÉÓÃpage wirte²Ù×÷¡£
	*/

	usAddr = _usAddress;	
	for (i = 0; i < _usSize; i++)
	{
		/* µ±·¢ËÍµÚ1¸ö×Ö½Ú»òÊÇÒ³ÃæÊ×µØÖ·Ê±£¬ĞèÒªÖØĞÂ·¢ÆğÆô¶¯ĞÅºÅºÍµØÖ· */
		if ((i == 0) || (usAddr & (EE_PAGE_SIZE - 1)) == 0)
		{
			/*¡¡µÚ£°²½£º·¢Í£Ö¹ĞÅºÅ£¬Æô¶¯ÄÚ²¿Ğ´²Ù×÷¡¡*/
			i2c_Stop();
			
			/* Í¨¹ı¼ì²éÆ÷¼şÓ¦´ğµÄ·½Ê½£¬ÅĞ¶ÏÄÚ²¿Ğ´²Ù×÷ÊÇ·ñÍê³É, Ò»°ãĞ¡ÓÚ 10ms 			
				CLKÆµÂÊÎª200KHzÊ±£¬²éÑ¯´ÎÊıÎª30´Î×óÓÒ
			*/
			for (m = 0; m < 100; m++)
			{				
				/* µÚ1²½£º·¢ÆğI2C×ÜÏßÆô¶¯ĞÅºÅ */
				i2c_Start();
				
				/* µÚ2²½£º·¢Æğ¿ØÖÆ×Ö½Ú£¬¸ß7bitÊÇµØÖ·£¬bit0ÊÇ¶ÁĞ´¿ØÖÆÎ»£¬0±íÊ¾Ğ´£¬1±íÊ¾¶Á */
				i2c_SendByte(EE_DEV_ADDR | I2C_WR);	/* ´Ë´¦ÊÇĞ´Ö¸Áî */
				
				/* µÚ3²½£º·¢ËÍÒ»¸öÊ±ÖÓ£¬ÅĞ¶ÏÆ÷¼şÊÇ·ñÕıÈ·Ó¦´ğ */
				if (i2c_WaitAck() == 0)
				{
					break;
				}
			}
			if (m  == 1000)
			{
				goto cmd_fail;	/* EEPROMÆ÷¼şĞ´³¬Ê± */
			}
		
			/* µÚ4²½£º·¢ËÍ×Ö½ÚµØÖ·£¬24C02Ö»ÓĞ256×Ö½Ú£¬Òò´Ë1¸ö×Ö½Ú¾Í¹»ÁË£¬Èç¹ûÊÇ24C04ÒÔÉÏ£¬ÄÇÃ´´Ë´¦ĞèÒªÁ¬·¢¶à¸öµØÖ· */
			i2c_SendByte((vu8)usAddr);
			
			/* µÚ5²½£º·¢ËÍACK */
			if (i2c_WaitAck() != 0)
			{
				goto cmd_fail;	/* EEPROMÆ÷¼şÎŞÓ¦´ğ */
			}
		}
	
		/* µÚ6²½£º¿ªÊ¼Ğ´ÈëÊı¾İ */
		i2c_SendByte(_pWriteBuf[i]);
	
		/* µÚ7²½£º·¢ËÍACK */
		if (i2c_WaitAck() != 0)
		{
			goto cmd_fail;	/* EEPROMÆ÷¼şÎŞÓ¦´ğ */
		}

		usAddr++;	/* µØÖ·Ôö1 */		
	}
	
	/* ÃüÁîÖ´ĞĞ³É¹¦£¬·¢ËÍI2C×ÜÏßÍ£Ö¹ĞÅºÅ */
	i2c_Stop();
	return 1;

cmd_fail: /* ÃüÁîÖ´ĞĞÊ§°Üºó£¬ÇĞ¼Ç·¢ËÍÍ£Ö¹ĞÅºÅ£¬±ÜÃâÓ°ÏìI2C×ÜÏßÉÏÆäËûÉè±¸ */
	/* ·¢ËÍI2C×ÜÏßÍ£Ö¹ĞÅºÅ */
	i2c_Stop();
	return 0; 
}

void ee_Erase(void)
{
	vu16 i;
	vu8 buf[EE_SIZE];
	
	/* Ìî³ä»º³åÇø */
	for (i = 0; i < EE_SIZE; i++)
	{
		buf[i] = 0xFF;
	}
	
	/* Ğ´EEPROM, ÆğÊ¼µØÖ· = 0£¬Êı¾İ³¤¶ÈÎª 256 */
}

/*
*********************************************************************************************************
*	º¯ Êı Ãû: EEPROM_WriteByte
*	¹¦ÄÜËµÃ÷: Ïò´®ĞĞEEPROMÖ¸¶¨µØÖ·Ğ´ÈëÒ»¸ö×Ö½Ú
*	ĞÎ    ²Î£ºAddr : µØÖ·
*			 Data : Êı¾İ
*			
*	·µ »Ø Öµ:
*********************************************************************************************************
*/
void EEPROM_WriteByte(vu16 Addr,vu8 Data)
{
	vu16 i,m;
	vu16 usAddr;
	/* 
		Ğ´´®ĞĞEEPROM²»Ïñ¶Á²Ù×÷¿ÉÒÔÁ¬Ğø¶ÁÈ¡ºÜ¶à×Ö½Ú£¬Ã¿´ÎĞ´²Ù×÷Ö»ÄÜÔÚÍ¬Ò»¸öpage¡£
		¶ÔÓÚ24xx02£¬page size = 8
		¼òµ¥µÄ´¦Àí·½·¨Îª£º°´×Ö½ÚĞ´²Ù×÷Ä£Ê½£¬Ã»Ğ´1¸ö×Ö½Ú£¬¶¼·¢ËÍµØÖ·
		ÎªÁËÌá¸ßÁ¬ĞøĞ´µÄĞ§ÂÊ: ±¾º¯Êı²ÉÓÃpage wirte²Ù×÷¡£
	*/
		usAddr = Addr;	
		/* µ±·¢ËÍµÚ1¸ö×Ö½Ú»òÊÇÒ³ÃæÊ×µØÖ·Ê±£¬ĞèÒªÖØĞÂ·¢ÆğÆô¶¯ĞÅºÅºÍµØÖ· */
			/*¡¡µÚ£°²½£º·¢Í£Ö¹ĞÅºÅ£¬Æô¶¯ÄÚ²¿Ğ´²Ù×÷¡¡*/
			i2c_Stop();
			
			/* Í¨¹ı¼ì²éÆ÷¼şÓ¦´ğµÄ·½Ê½£¬ÅĞ¶ÏÄÚ²¿Ğ´²Ù×÷ÊÇ·ñÍê³É, Ò»°ãĞ¡ÓÚ 10ms 			
				CLKÆµÂÊÎª200KHzÊ±£¬²éÑ¯´ÎÊıÎª30´Î×óÓÒ
			*/
			for (m = 0; m < 100; m++)
			{				
				/* µÚ1²½£º·¢ÆğI2C×ÜÏßÆô¶¯ĞÅºÅ */
				i2c_Start();
				
				/* µÚ2²½£º·¢Æğ¿ØÖÆ×Ö½Ú£¬¸ß7bitÊÇµØÖ·£¬bit0ÊÇ¶ÁĞ´¿ØÖÆÎ»£¬0±íÊ¾Ğ´£¬1±íÊ¾¶Á */
				i2c_SendByte(EE_DEV_ADDR | I2C_WR);	/* ´Ë´¦ÊÇĞ´Ö¸Áî */
				
				/* µÚ3²½£º·¢ËÍÒ»¸öÊ±ÖÓ£¬ÅĞ¶ÏÆ÷¼şÊÇ·ñÕıÈ·Ó¦´ğ */
				if (i2c_WaitAck() == 0)
				{
					break;
				}
			}
			if (m  == 1000)
			{
				goto cmd_fail;	/* EEPROMÆ÷¼şĞ´³¬Ê± */
			}
		
			/* µÚ4²½£º·¢ËÍ×Ö½ÚµØÖ·£¬24C02Ö»ÓĞ256×Ö½Ú£¬Òò´Ë1¸ö×Ö½Ú¾Í¹»ÁË£¬Èç¹ûÊÇ24C04ÒÔÉÏ£¬ÄÇÃ´´Ë´¦ĞèÒªÁ¬·¢¶à¸öµØÖ· */
			i2c_SendByte((vu8)usAddr);
			
			/* µÚ5²½£º·¢ËÍACK */
			if (i2c_WaitAck() != 0)
			{
				goto cmd_fail;	/* EEPROMÆ÷¼şÎŞÓ¦´ğ */
			}
		/* µÚ6²½£º¿ªÊ¼Ğ´ÈëÊı¾İ */
		i2c_SendByte(Data);
	
		/* µÚ7²½£º·¢ËÍACK */
		if (i2c_WaitAck() != 0)
		{
			goto cmd_fail;	/* EEPROMÆ÷¼şÎŞÓ¦´ğ */
		}
		/* ÃüÁîÖ´ĞĞ³É¹¦£¬·¢ËÍI2C×ÜÏßÍ£Ö¹ĞÅºÅ */
		i2c_Stop();
		

		cmd_fail: /* ÃüÁîÖ´ĞĞÊ§°Üºó£¬ÇĞ¼Ç·¢ËÍÍ£Ö¹ĞÅºÅ£¬±ÜÃâÓ°ÏìI2C×ÜÏßÉÏÆäËûÉè±¸ */
		/* ·¢ËÍI2C×ÜÏßÍ£Ö¹ĞÅºÅ */
		i2c_Stop();
		          
}
/*
*********************************************************************************************************
*	º¯ Êı Ãû: EEPROM_ReadByte
*	¹¦ÄÜËµÃ÷: ¶ÁÈ¡Ö¸¶¨µØÖ·Êı¾İ
*	ĞÎ    ²Î£ReadAddr: ÆğÊ¼µØÖ·
*			 
*			 
*	
*********************************************************************************************************
*/
vu8 EEPROM_READ_Byte(vu8 ReadAddr)
{
	vu16 i;
	static vu8 date;
	/* ²ÉÓÃ´®ĞĞEEPROMËæ¼´¶ÁÈ¡Ö¸ÁîĞòÁĞ£¬Á¬Ğø¶ÁÈ¡Ò»¸ö×Ö½Ú */
	
	/* µÚ1²½£º·¢ÆğI2C×ÜÏßÆô¶¯ĞÅºÅ */
	i2c_Start();
	
	/* µÚ2²½£º·¢Æğ¿ØÖÆ×Ö½Ú£¬¸ß7bitÊÇµØÖ·£¬bit0ÊÇ¶ÁĞ´¿ØÖÆÎ»£¬0±íÊ¾Ğ´£¬1±íÊ¾¶Á */
	i2c_SendByte(EE_DEV_ADDR | I2C_WR);	/* ´Ë´¦ÊÇĞ´Ö¸Áî */
	
	/* µÚ3²½£º·¢ËÍACK */
	if (i2c_WaitAck() != 0)
	{
		goto cmd_fail;	/* EEPROMÆ÷¼şÎŞÓ¦´ğ */
	}

	/* µÚ4²½£º·¢ËÍ×Ö½ÚµØÖ·£¬24C02Ö»ÓĞ256×Ö½Ú£¬Òò´Ë1¸ö×Ö½Ú¾Í¹»ÁË£¬Èç¹ûÊÇ24C04ÒÔÉÏ£¬ÄÇÃ´´Ë´¦ĞèÒªÁ¬·¢¶à¸öµØÖ· */
	i2c_SendByte(ReadAddr);
	
	/* µÚ5²½£º·¢ËÍACK */
	if (i2c_WaitAck() != 0)
	{
		goto cmd_fail;	/* EEPROMÆ÷¼şÎŞÓ¦´ğ */
	}
	
	/* µÚ6²½£ºÖØĞÂÆô¶¯I2C×ÜÏß¡£Ç°ÃæµÄ´úÂëµÄÄ¿µÄÏòEEPROM´«ËÍµØÖ·£¬ÏÂÃæ¿ªÊ¼¶ÁÈ¡Êı¾İ */
	i2c_Start();
	
	/* µÚ7²½£º·¢Æğ¿ØÖÆ×Ö½Ú£¬¸ß7bitÊÇµØÖ·£¬bit0ÊÇ¶ÁĞ´¿ØÖÆÎ»£¬0±íÊ¾Ğ´£¬1±íÊ¾¶Á */
	i2c_SendByte(EE_DEV_ADDR | I2C_RD);	/* ´Ë´¦ÊÇ¶ÁÖ¸Áî */
	
	/* µÚ8²½£º·¢ËÍACK */
	if (i2c_WaitAck() != 0)
	{
		goto cmd_fail;	/* EEPROMÆ÷¼şÎŞÓ¦´ğ */
	}	
	
	/* µÚ9²½£ºÑ­»·¶ÁÈ¡Êı¾İ */

	 date= i2c_ReadByte();	/* ¶Á1¸ö×Ö½Ú */
	
	/* Ã¿¶ÁÍê1¸ö×Ö½Úºó£¬ĞèÒª·¢ËÍAck£¬ ×îºóÒ»¸ö×Ö½Ú²»ĞèÒªAck£¬·¢Nack */
	i2c_NAck();	/* ×îºó1¸ö×Ö½Ú¶ÁÍêºó£¬CPU²úÉúNACKĞÅºÅ(Çı¶¯SDA = 1) */
	/* ·¢ËÍI2C×ÜÏßÍ£Ö¹ĞÅºÅ */
	i2c_Stop();
	return date;	/* Ö´ĞĞ³É¹¦ ·µ»Ø¶ÁÈ¡Êı¾İ*/
	
	cmd_fail: /* ÃüÁîÖ´ĞĞÊ§°Üºó£¬ÇĞ¼Ç·¢ËÍÍ£Ö¹ĞÅºÅ£¬±ÜÃâÓ°ÏìI2C×ÜÏßÉÏÆäËûÉè±¸ */
	/* ·¢ËÍI2C×ÜÏßÍ£Ö¹ĞÅºÅ */
	i2c_Stop();
	return 0;
}

/*--------------------------------------------------------------------------------------------------*/

static void ee_Delay( vu32 nCount)	 //¼òµ¥µÄÑÓÊ±º¯Êı
{
	for(; nCount != 0; nCount--);
}

/*
 * eeprom AT24C02 ¶ÁĞ´²âÊÔ
 */
/*********************************************END OF FILE**********************/
